#  Group by

In [4]:
import numpy as np
import pandas as pd

In [5]:
sales_data = {'Company':['GooG','GooG','MSFT','MSFT','FB','FB'],
       'Person': ['John Smith','Jane Doe','Amy','Andy','Charlie','Karla'],
       'Sales': [200,400,600,1000,1200,10000]}

In [7]:
df = pd.DataFrame(data = sales_data)
df

  Company      Person  Sales
0    GooG  John Smith    200
1    GooG    Jane Doe    400
2    MSFT         Amy    600
3    MSFT        Andy   1000
4      FB     Charlie   1200
5      FB       Karla  10000

In [13]:
grupbycomp = df.groupby('Company')
grupbycomp

In [14]:
grupbycomp.count()

         Person  Sales
Company
FB            2      2
GooG          2      2
MSFT          2      2

In [15]:
grupbycomp.mean()

         Sales
Company
FB        5600
GooG       300
MSFT       800

In [16]:
grupbycomp.sum()

         Sales
Company
FB       11200
GooG       600
MSFT      1600

In [17]:
grupbycomp.sum().loc['FB']

Sales    11200
Name: FB, dtype: int64

In [18]:
grupbycomp.sum().loc['GooG']

Sales    600
Name: GooG, dtype: int64

In [19]:
df

  Company      Person  Sales
0    GooG  John Smith    200
1    GooG    Jane Doe    400
2    MSFT         Amy    600
3    MSFT        Andy   1000
4      FB     Charlie   1200
5      FB       Karla  10000

In [22]:
df.groupby('Company').max()

             Person  Sales
Company
FB            Karla  10000
GooG     John Smith    400
MSFT           Andy   1000

In [23]:
df.groupby('Company').min()

           Person  Sales
Company
FB        Charlie   1200
GooG     Jane Doe    200
MSFT          Amy    600

In [24]:
df.groupby('Company').describe()

        Sales
        count    mean          std     min     25%     50%     75%      max
Company
FB        2.0  5600.0  6222.539674  1200.0  3400.0  5600.0  7800.0  10000.0
GooG      2.0   300.0   141.421356   200.0   250.0   300.0   350.0    400.0
MSFT      2.0   800.0   282.842712   600.0   700.0   800.0   900.0   1000.0

In [26]:
df.groupby('Company').describe().T   # .transpose() = T

Company                FB        GooG         MSFT
Sales count      2.000000    2.000000     2.000000
      mean    5600.000000  300.000000   800.000000
      std     6222.539674  141.421356   282.842712
      min     1200.000000  200.000000   600.000000
      25%     3400.000000  250.000000   700.000000
      50%     5600.000000  300.000000   800.000000
      75%     7800.000000  350.000000   900.000000
      max    10000.000000  400.000000  1000.000000

In [28]:
df.groupby('Company').describe().transpose()['FB']

Sales  count        2.000000
       mean      5600.000000
       std       6222.539674
       min       1200.000000
       25%       3400.000000
       50%       5600.000000
       75%       7800.000000
       max      10000.000000
Name: FB, dtype: float64

In [31]:
df.groupby('Company').describe().transpose()[['FB','GooG']]

Company                FB        GooG
Sales count      2.000000    2.000000
      mean    5600.000000  300.000000
      std     6222.539674  141.421356
      min     1200.000000  200.000000
      25%     3400.000000  250.000000
      50%     5600.000000  300.000000
      75%     7800.000000  350.000000
      max    10000.000000  400.000000

In [33]:
df

  Company      Person  Sales
0    GooG  John Smith    200
1    GooG    Jane Doe    400
2    MSFT         Amy    600
3    MSFT        Andy   1000
4      FB     Charlie   1200
5      FB       Karla  10000

# New columns add

In [34]:
newstring = 'CA NY NJ IN OH CO'

In [35]:
newx = newstring.split()

In [36]:
newx

['CA', 'NY', 'NJ', 'IN', 'OH', 'CO']

In [38]:
df['States'] = newx
df

  Company      Person  Sales States
0    GooG  John Smith    200     CA
1    GooG    Jane Doe    400     NY
2    MSFT         Amy    600     NJ
3    MSFT        Andy   1000     IN
4      FB     Charlie   1200     OH
5      FB       Karla  10000     CO

In [39]:
# if we want to make the column states as Index

df.set_index('States')

       Company      Person  Sales
States
CA        GooG  John Smith    200
NY        GooG    Jane Doe    400
NJ        MSFT         Amy    600
IN        MSFT        Andy   1000
OH          FB     Charlie   1200
CO          FB       Karla  10000